In [1]:
import pandas as pd

In [2]:
flights = pd.read_csv('/Users/slavicagjorgieva/Desktop/TU/WS23/DOPP/Ex2/DOPP_group18/datasets/flight_times_cleaned.csv')
trains =  pd.read_csv('/Users/slavicagjorgieva/Desktop/TU/WS23/DOPP/Ex2/DOPP_group18/datasets/train-distances3.csv')
trains

                 city1       city2  transit_distance [m]  transit_time [s]
0           Copenhagen      Madrid               2766617            116760
1           Dusseldorf      Madrid               1903205             80100
2               London      Madrid               1783116             70560
3               London      Madrid               1783116             70560
4               Nantes      Madrid                836131             55500
..                 ...         ...                   ...               ...
334         Copenhagen     Bolzano               1380287             64920
335         Dusseldorf  Copenhagen                907801             44580
336  Frankfurt am Main        Graz                849063             32520
337  Frankfurt am Main  Dusseldorf                220414              4985
338          Marseille      Nantes               1076151             46500

[339 rows x 4 columns]

In [3]:
flights

,route,time,departure airport,arrival airport,city2,city1
0,"{'ABZ', 'AMS'}",95.0,ABZ,AMS,Amsterdam,Aberdeen
1,"{'LTN', 'AMS'}",70.0,LTN,AMS,Amsterdam,Luton
2,"{'LTN', 'BCN'}",125.0,LTN,BCN,Barcelona,Luton
3,"{'LTN', 'BFS'}",75.0,LTN,BFS,Belfast,Luton
4,"{'LTN', 'EDI'}",75.0,LTN,EDI,Edinburgh,Luton
...,...,...,...,...,...,...
334,"{'MMX', 'ARN'}",70.0,MMX,ARN,Stockholm,Malmo
335,"{'MMX', 'BMA'}",80.0,MMX,BMA,Stockholm,Malmo
336,"{'STR', 'SKG'}",135.0,STR,SKG,Thessaloniki,Stuttgart
337,"{'TUF', 'STN'}",85.0,TUF,STN,London,Tours
338,"{'SKG', 'STR'}",150.0,SKG,STR,Stuttgart,Thessaloniki

In [4]:
print("Number of rows in flights:", flights.shape[0])
print("Number of rows in trains:", trains.shape[0])

Number of rows in flights: 339
Number of rows in trains: 339

In [5]:
merged_data = pd.merge(flights, trains, on=['city1', 'city2'])
print("Number of rows in merged data:", merged_data.shape[0])

Number of rows in merged data: 371

In [6]:
cleaned_data = merged_data.drop_duplicates()
print("Number of rows after removing duplicates:", cleaned_data.shape[0])
cleaned_data.info()

Number of rows after removing duplicates: 339
<class 'pandas.core.frame.DataFrame'>
Int64Index: 339 entries, 0 to 370
Data columns (total 8 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   route                 339 non-null    object
 1   time                  339 non-null    float64
 2   departure airport     339 non-null    object
 3   arrival airport       339 non-null    object
 4   city2                 339 non-null    object
 5   city1                 339 non-null    object
 6   transit_distance [m]  339 non-null    int64
 7   transit_time [s]      339 non-null    int64
dtypes: float64(1), int64(2), object(5)
memory usage: 23.8+ KB

In [7]:
cleaned_data.describe()

             time  transit_distance [m]  transit_time [s]
count  339.000000          3.390000e+02        339.000000
mean   116.311209          1.347607e+06      58342.477876
std     39.266687          7.744459e+05      33066.454705
min     45.000000         -1.000000e+00         -1.000000
25%     85.000000          7.312265e+05      37987.500000
50%    115.000000          1.299474e+06      57060.000000
75%    145.000000          1.814400e+06      76590.000000
max    265.000000          3.998052e+06     179473.000000

In [8]:
filtered_data = cleaned_data[cleaned_data['transit_distance [m]'] != -1]
cleaned_df = filtered_data[filtered_data['transit_time [s]'] != -1]
cleaned_df
cleaned_df.to_csv('datasets/merged_df.csv')